; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v7 - type_1 ?v2 - type_2)
 	      (pred_3 ?v5 - object ?v2 - type_2)
	      (pred_4 ?v7 - type_1 ?v4 - type_3)
	      (pred_1 ?v7 - type_1 ?v5 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v7 - type_1 ?v8 ?v1 - type_2)
       :precondition (and  (pred_2 ?v7 ?v8))
       :effect (and  (pred_2 ?v7 ?v1)
		     (not (pred_2 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_1 ?v6 - object ?v3 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v3) (pred_2 ?v7 ?v3) (pred_4 ?v7 ?v4))
       :effect (and (pred_1 ?v7 ?v6 ?v4)
		    (not (pred_3 ?v6 ?v3)) 
		    (not (pred_4 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_1 ?v6 - object ?v3 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v6 ?v4) (pred_2 ?v7 ?v3))
       :effect (and (pred_3 ?v6 ?v3)
		    (pred_4 ?v7 ?v4)
		    (not (pred_1 ?v7 ?v6 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_09 - type_1
obj_06 obj_04 obj_07 obj_08 - type_3
obj_10 obj_11 obj_05 obj_01 - type_2
obj_02 obj_03 obj_13 - object)
(:init
(pred_2 obj_12 obj_05)
(pred_4 obj_12 obj_06)
(pred_4 obj_12 obj_04)
(pred_2 obj_09 obj_05)
(pred_4 obj_09 obj_07)
(pred_4 obj_09 obj_08)
(pred_3 obj_02 obj_10)
(pred_3 obj_03 obj_01)
(pred_3 obj_13 obj_11)
)
(:goal
(and
(pred_3 obj_02 obj_10)
(pred_3 obj_03 obj_11)
(pred_3 obj_13 obj_01)
)
)

(:constraints
  (always (not (pred_2 obj_12 obj_01)))
)
)

; plan
1. (op_3 obj_12 obj_05 obj_11)
   deleted: (pred_2 obj_12 obj_05)
   added: (pred_2 obj_12 obj_11)
   goals met: 1 of 3
2. (op_3 obj_09 obj_05 obj_11)
   deleted: (pred_2 obj_09 obj_05)
   added: (pred_2 obj_09 obj_11)
   goals met: 1 of 3
3. (op_2 obj_09 obj_13 obj_11 obj_08)
   deleted: (pred_3 obj_13 obj_11) (pred_4 obj_09 obj_08)
   added: (pred_1 obj_09 obj_13 obj_08)
   goals met: 1 of 3
4. (op_3 obj_09 obj_11 obj_01)
   deleted: (pred_2 obj_09 obj_11)
   added: (pred_2 obj_09 obj_01)
   goals met: 1 of 3
5. (op_1 obj_09 obj_13 obj_01 obj_08)
   deleted: (pred_1 obj_09 obj_13 obj_08)
   added: (pred_3 obj_13 obj_01) (pred_4 obj_09 obj_08)
   goals met: 2 of 3
6. (op_2 obj_09 obj_03 obj_01 obj_08)
   deleted: (pred_3 obj_03 obj_01) (pred_4 obj_09 obj_08)
   added: (pred_1 obj_09 obj_03 obj_08)
   goals met: 2 of 3
7. (op_3 obj_09 obj_01 obj_11)
   deleted: (pred_2 obj_09 obj_01)
   added: (pred_2 obj_09 obj_11)
   goals met: 2 of 3
8. (op_1 obj_09 obj_03 obj_11 obj_08)
   deleted: (pred_1 obj_09 obj_03 obj_08)
   added: (pred_3 obj_03 obj_11) (pred_4 obj_09 obj_08)
   goals met: 3 of 3
